// Задача 20. 
// Напишите программу, которая принимает на вход координаты двух точек 
// и находит расстояние между ними в 2D пространстве

// А (3,6), B(2,1) -> 5.9
// А (7,-5), B(1,-1) -> 7.21

double d = Math.Sqrt(45);

double s = 156.1564165;
double res = Math.Round(s, 2, MidpointRounding.ToZero);
Sistem.Console.WriteLine(res);